import Toast from '@vant/weapp/toast/toast';

const SOURCE_DATA = [{"预估损失合计":94789.5574850299,"个人绩效平均值":"319261","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"三级副以上领导人员","薪酬扣减数额":15963.05,"违法行为":"饮酒后驾驶机动车","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":78826.5074850299,"影响期":"一年"},{"预估损失合计":49336.5146969697,"个人绩效平均值":"140206.4","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"厂机关一般管理人员","薪酬扣减数额":7010.32,"违法行为":"饮酒后驾驶机动车","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":42326.1946969697,"影响期":"一年"},{"预估损失合计":41252.7105666667,"个人绩效平均值":"113506.218","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"各作业区机关一般管理人员","薪酬扣减数额":5675.3109,"违法行为":"饮酒后驾驶机动车","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":35577.3996666667,"影响期":"一年"},{"预估损失合计":43640.891370224,"个人绩效平均值":"118202.893280632","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"一线班组正职","薪酬扣减数额":5910.1446640316,"违法行为":"饮酒后驾驶机动车","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":37730.7467061924,"影响期":"一年"},{"预估损失合计":35730.4564777098,"个人绩效平均值":"94333.8452989068","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"一线班组副职、技术员","薪酬扣减数额":4716.69226494534,"违法行为":"饮酒后驾驶机动车","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":31013.7642127645,"影响期":"一年"},{"预估损失合计":40770.8668115942,"个人绩效平均值":"117114.713043478","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"二线班组正职","薪酬扣减数额":5855.7356521739,"违法行为":"饮酒后驾驶机动车","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":34915.1311594203,"影响期":"一年"},{"预估损失合计":35269.39625,"个人绩效平均值":"93312.925","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"二线班组副职、技术员","薪酬扣减数额":4665.64625,"违法行为":"饮酒后驾驶机动车","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":30603.75,"影响期":"一年"},{"预估损失合计":33579.7454367985,"个人绩效平均值":"92489.8770131772","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"专业技术人员","薪酬扣减数额":4624.49385065886,"违法行为":"饮酒后驾驶机动车","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":28955.2515861396,"影响期":"一年"},{"预估损失合计":22325.3711755659,"个人绩效平均值":"51489.5431038027","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"一线岗位操作人员","薪酬扣减数额":2574.47715519014,"违法行为":"饮酒后驾驶机动车","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":19750.8940203758,"影响期":"一年"},{"预估损失合计":21947.4534739408,"个人绩效平均值":"50740.9051245545","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"二线岗位操作人员","薪酬扣减数额":2537.04525622773,"违法行为":"饮酒后驾驶机动车","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":19410.4082177131,"影响期":"一年"},{"预估损失合计":15963.05,"个人绩效平均值":"319261","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"三级副以上领导人员","薪酬扣减数额":15963.05,"违法行为":"参与赌博","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":7010.32,"个人绩效平均值":"140206.4","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"厂机关一般管理人员","薪酬扣减数额":7010.32,"违法行为":"参与赌博","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":5675.3109,"个人绩效平均值":"113506.218","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"各作业区机关一般管理人员","薪酬扣减数额":5675.3109,"违法行为":"参与赌博","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":5910.1446640316,"个人绩效平均值":"118202.893280632","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"一线班组正职","薪酬扣减数额":5910.1446640316,"违法行为":"参与赌博","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":4716.69226494534,"个人绩效平均值":"94333.8452989068","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"一线班组副职、技术员","薪酬扣减数额":4716.69226494534,"违法行为":"参与赌博","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":5855.7356521739,"个人绩效平均值":"117114.713043478","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"二线班组正职","薪酬扣减数额":5855.7356521739,"违法行为":"参与赌博","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":4665.64625,"个人绩效平均值":"93312.925","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"二线班组副职、技术员","薪酬扣减数额":4665.64625,"违法行为":"参与赌博","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":4624.49385065886,"个人绩效平均值":"92489.8770131772","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"专业技术人员","薪酬扣减数额":4624.49385065886,"违法行为":"参与赌博","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":2574.47715519014,"个人绩效平均值":"51489.5431038027","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"一线岗位操作人员","薪酬扣减数额":2574.47715519014,"违法行为":"参与赌博","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":2537.04525622773,"个人绩效平均值":"50740.9051245545","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"二线岗位操作人员","薪酬扣减数额":2537.04525622773,"违法行为":"参与赌博","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":15963.05,"个人绩效平均值":"319261","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"三级副以上领导人员","薪酬扣减数额":15963.05,"违法行为":"殴打他人","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":7010.32,"个人绩效平均值":"140206.4","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"厂机关一般管理人员","薪酬扣减数额":7010.32,"违法行为":"殴打他人","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":5675.3109,"个人绩效平均值":"113506.218","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"各作业区机关一般管理人员","薪酬扣减数额":5675.3109,"违法行为":"殴打他人","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":5910.1446640316,"个人绩效平均值":"118202.893280632","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"一线班组正职","薪酬扣减数额":5910.1446640316,"违法行为":"殴打他人","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":4716.69226494534,"个人绩效平均值":"94333.8452989068","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"一线班组副职、技术员","薪酬扣减数额":4716.69226494534,"违法行为":"殴打他人","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":5855.7356521739,"个人绩效平均值":"117114.713043478","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"二线班组正职","薪酬扣减数额":5855.7356521739,"违法行为":"殴打他人","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":4665.64625,"个人绩效平均值":"93312.925","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"二线班组副职、技术员","薪酬扣减数额":4665.64625,"违法行为":"殴打他人","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":4624.49385065886,"个人绩效平均值":"92489.8770131772","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"专业技术人员","薪酬扣减数额":4624.49385065886,"违法行为":"殴打他人","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":2574.47715519014,"个人绩效平均值":"51489.5431038027","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"一线岗位操作人员","薪酬扣减数额":2574.47715519014,"违法行为":"殴打他人","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":2537.04525622773,"个人绩效平均值":"50740.9051245545","处分（按最轻处分举例）":"党内警告","薪酬扣减":0.05,"人员类别（党员）":"二线岗位操作人员","薪酬扣减数额":2537.04525622773,"违法行为":"殴打他人","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"一年"},{"预估损失合计":206530.90748503,"个人绩效平均值":"319261","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"三级副以上领导人员","薪酬扣减数额":127704.4,"违法行为":"嫖娼","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":78826.5074850299,"影响期":"五年"},{"预估损失合计":98408.7546969697,"个人绩效平均值":"140206.4","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"厂机关一般管理人员","薪酬扣减数额":56082.56,"违法行为":"嫖娼","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":42326.1946969697,"影响期":"五年"},{"预估损失合计":80979.8868666667,"个人绩效平均值":"113506.218","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"各作业区机关一般管理人员","薪酬扣减数额":45402.4872,"违法行为":"嫖娼","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":35577.3996666667,"影响期":"五年"},{"预估损失合计":85011.9040184452,"个人绩效平均值":"118202.893280632","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"一线班组正职","薪酬扣减数额":47281.1573122528,"违法行为":"嫖娼","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":37730.7467061924,"影响期":"五年"},{"预估损失合计":68747.3023323272,"个人绩效平均值":"94333.8452989068","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"一线班组副职、技术员","薪酬扣减数额":37733.5381195627,"违法行为":"嫖娼","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":31013.7642127645,"影响期":"五年"},{"预估损失合计":81761.0163768115,"个人绩效平均值":"117114.713043478","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"二线班组正职","薪酬扣减数额":46845.8852173912,"违法行为":"嫖娼","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":34915.1311594203,"影响期":"五年"},{"预估损失合计":67928.92,"个人绩效平均值":"93312.925","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"二线班组副职、技术员","薪酬扣减数额":37325.17,"违法行为":"嫖娼","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":30603.75,"影响期":"五年"},{"预估损失合计":65951.2023914105,"个人绩效平均值":"92489.8770131772","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"专业技术人员","薪酬扣减数额":36995.9508052709,"违法行为":"嫖娼","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":28955.2515861396,"影响期":"五年"},{"预估损失合计":40346.7112618969,"个人绩效平均值":"51489.5431038027","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"一线岗位操作人员","薪酬扣减数额":20595.8172415211,"违法行为":"嫖娼","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":19750.8940203758,"影响期":"五年"},{"预估损失合计":39706.7702675349,"个人绩效平均值":"50740.9051245545","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"二线岗位操作人员","薪酬扣减数额":20296.3620498218,"违法行为":"嫖娼","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":19410.4082177131,"影响期":"五年"},{"预估损失合计":206530.90748503,"个人绩效平均值":"319261","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"三级副以上领导人员","薪酬扣减数额":127704.4,"违法行为":"吸食、注射毒品","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":78826.5074850299,"影响期":"五年"},{"预估损失合计":98408.7546969697,"个人绩效平均值":"140206.4","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"厂机关一般管理人员","薪酬扣减数额":56082.56,"违法行为":"吸食、注射毒品","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":42326.1946969697,"影响期":"五年"},{"预估损失合计":80979.8868666667,"个人绩效平均值":"113506.218","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"各作业区机关一般管理人员","薪酬扣减数额":45402.4872,"违法行为":"吸食、注射毒品","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":35577.3996666667,"影响期":"五年"},{"预估损失合计":85011.9040184452,"个人绩效平均值":"118202.893280632","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"一线班组正职","薪酬扣减数额":47281.1573122528,"违法行为":"吸食、注射毒品","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":37730.7467061924,"影响期":"五年"},{"预估损失合计":68747.3023323272,"个人绩效平均值":"94333.8452989068","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"一线班组副职、技术员","薪酬扣减数额":37733.5381195627,"违法行为":"吸食、注射毒品","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":31013.7642127645,"影响期":"五年"},{"预估损失合计":81761.0163768115,"个人绩效平均值":"117114.713043478","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"二线班组正职","薪酬扣减数额":46845.8852173912,"违法行为":"吸食、注射毒品","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":34915.1311594203,"影响期":"五年"},{"预估损失合计":67928.92,"个人绩效平均值":"93312.925","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"二线班组副职、技术员","薪酬扣减数额":37325.17,"违法行为":"吸食、注射毒品","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":30603.75,"影响期":"五年"},{"预估损失合计":65951.2023914105,"个人绩效平均值":"92489.8770131772","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"专业技术人员","薪酬扣减数额":36995.9508052709,"违法行为":"吸食、注射毒品","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":28955.2515861396,"影响期":"五年"},{"预估损失合计":40346.7112618969,"个人绩效平均值":"51489.5431038027","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"一线岗位操作人员","薪酬扣减数额":20595.8172415211,"违法行为":"吸食、注射毒品","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":19750.8940203758,"影响期":"五年"},{"预估损失合计":39706.7702675349,"个人绩效平均值":"50740.9051245545","处分（按最轻处分举例）":"开除党籍、撤职","薪酬扣减":0.4,"人员类别（党员）":"二线岗位操作人员","薪酬扣减数额":20296.3620498218,"违法行为":"吸食、注射毒品","是否被司法机关行政拘留或采取刑事强制措施期间":"是（以拘留一个月内为例）","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":19410.4082177131,"影响期":"五年"},{"预估损失合计":127704.4,"个人绩效平均值":"319261","处分（按最轻处分举例）":"撤销党内职务、撤职","薪酬扣减":0.4,"人员类别（党员）":"三级副以上领导人员","薪酬扣减数额":127704.4,"违法行为":"涉嫌犯罪被不起诉决定","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"两年"},{"预估损失合计":56082.56,"个人绩效平均值":"140206.4","处分（按最轻处分举例）":"撤销党内职务、撤职","薪酬扣减":0.4,"人员类别（党员）":"厂机关一般管理人员","薪酬扣减数额":56082.56,"违法行为":"涉嫌犯罪被不起诉决定","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"两年"},{"预估损失合计":45402.4872,"个人绩效平均值":"113506.218","处分（按最轻处分举例）":"撤销党内职务、撤职","薪酬扣减":0.4,"人员类别（党员）":"各作业区机关一般管理人员","薪酬扣减数额":45402.4872,"违法行为":"涉嫌犯罪被不起诉决定","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"两年"},{"预估损失合计":47281.1573122528,"个人绩效平均值":"118202.893280632","处分（按最轻处分举例）":"撤销党内职务、撤职","薪酬扣减":0.4,"人员类别（党员）":"一线班组正职","薪酬扣减数额":47281.1573122528,"违法行为":"涉嫌犯罪被不起诉决定","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"两年"},{"预估损失合计":37733.5381195627,"个人绩效平均值":"94333.8452989068","处分（按最轻处分举例）":"撤销党内职务、撤职","薪酬扣减":0.4,"人员类别（党员）":"一线班组副职、技术员","薪酬扣减数额":37733.5381195627,"违法行为":"涉嫌犯罪被不起诉决定","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"两年"},{"预估损失合计":46845.8852173912,"个人绩效平均值":"117114.713043478","处分（按最轻处分举例）":"撤销党内职务、撤职","薪酬扣减":0.4,"人员类别（党员）":"二线班组正职","薪酬扣减数额":46845.8852173912,"违法行为":"涉嫌犯罪被不起诉决定","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"两年"},{"预估损失合计":37325.17,"个人绩效平均值":"93312.925","处分（按最轻处分举例）":"撤销党内职务、撤职","薪酬扣减":0.4,"人员类别（党员）":"二线班组副职、技术员","薪酬扣减数额":37325.17,"违法行为":"涉嫌犯罪被不起诉决定","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"两年"},{"预估损失合计":36995.9508052709,"个人绩效平均值":"92489.8770131772","处分（按最轻处分举例）":"撤销党内职务、撤职","薪酬扣减":0.4,"人员类别（党员）":"专业技术人员","薪酬扣减数额":36995.9508052709,"违法行为":"涉嫌犯罪被不起诉决定","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"两年"},{"预估损失合计":20595.8172415211,"个人绩效平均值":"51489.5431038027","处分（按最轻处分举例）":"撤销党内职务、撤职","薪酬扣减":0.4,"人员类别（党员）":"一线岗位操作人员","薪酬扣减数额":20595.8172415211,"违法行为":"涉嫌犯罪被不起诉决定","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"两年"},{"预估损失合计":20296.3620498218,"个人绩效平均值":"50740.9051245545","处分（按最轻处分举例）":"撤销党内职务、撤职","薪酬扣减":0.4,"人员类别（党员）":"二线岗位操作人员","薪酬扣减数额":20296.3620498218,"违法行为":"涉嫌犯罪被不起诉决定","是否被司法机关行政拘留或采取刑事强制措施期间":"否","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":"两年"},{"预估损失合计":"","个人绩效平均值":"","处分（按最轻处分举例）":"开除党籍、开除","薪酬扣减":"扣减全部未发放绩效薪酬，取消全部未行权的中长期激励权益","人员类别（党员）":"三级副以上领导人员","薪酬扣减数额":"","违法行为":"危险驾驶罪（醉驾）","是否被司法机关行政拘留或采取刑事强制措施期间":"","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":""},{"预估损失合计":"","个人绩效平均值":"","处分（按最轻处分举例）":"开除党籍、开除","薪酬扣减":"扣减全部未发放绩效薪酬，取消全部未行权的中长期激励权益","人员类别（党员）":"厂机关一般管理人员","薪酬扣减数额":"","违法行为":"危险驾驶罪（醉驾）","是否被司法机关行政拘留或采取刑事强制措施期间":"","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":""},{"预估损失合计":"","个人绩效平均值":"","处分（按最轻处分举例）":"开除党籍、开除","薪酬扣减":"扣减全部未发放绩效薪酬，取消全部未行权的中长期激励权益","人员类别（党员）":"各作业区机关一般管理人员","薪酬扣减数额":"","违法行为":"危险驾驶罪（醉驾）","是否被司法机关行政拘留或采取刑事强制措施期间":"","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":""},{"预估损失合计":"","个人绩效平均值":"","处分（按最轻处分举例）":"开除党籍、开除","薪酬扣减":"扣减全部未发放绩效薪酬，取消全部未行权的中长期激励权益","人员类别（党员）":"一线班组正职","薪酬扣减数额":"","违法行为":"危险驾驶罪（醉驾）","是否被司法机关行政拘留或采取刑事强制措施期间":"","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":""},{"预估损失合计":"","个人绩效平均值":"","处分（按最轻处分举例）":"开除党籍、开除","薪酬扣减":"扣减全部未发放绩效薪酬，取消全部未行权的中长期激励权益","人员类别（党员）":"一线班组副职、技术员","薪酬扣减数额":"","违法行为":"危险驾驶罪（醉驾）","是否被司法机关行政拘留或采取刑事强制措施期间":"","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":""},{"预估损失合计":"","个人绩效平均值":"","处分（按最轻处分举例）":"开除党籍、开除","薪酬扣减":"扣减全部未发放绩效薪酬，取消全部未行权的中长期激励权益","人员类别（党员）":"二线班组正职","薪酬扣减数额":"","违法行为":"危险驾驶罪（醉驾）","是否被司法机关行政拘留或采取刑事强制措施期间":"","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":""},{"预估损失合计":"","个人绩效平均值":"","处分（按最轻处分举例）":"开除党籍、开除","薪酬扣减":"扣减全部未发放绩效薪酬，取消全部未行权的中长期激励权益","人员类别（党员）":"二线班组副职、技术员","薪酬扣减数额":"","违法行为":"危险驾驶罪（醉驾）","是否被司法机关行政拘留或采取刑事强制措施期间":"","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":""},{"预估损失合计":"","个人绩效平均值":"","处分（按最轻处分举例）":"开除党籍、开除","薪酬扣减":"扣减全部未发放绩效薪酬，取消全部未行权的中长期激励权益","人员类别（党员）":"专业技术人员","薪酬扣减数额":"","违法行为":"危险驾驶罪（醉驾）","是否被司法机关行政拘留或采取刑事强制措施期间":"","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":""},{"预估损失合计":"","个人绩效平均值":"","处分（按最轻处分举例）":"开除党籍、开除","薪酬扣减":"扣减全部未发放绩效薪酬，取消全部未行权的中长期激励权益","人员类别（党员）":"一线岗位操作人员","薪酬扣减数额":"","违法行为":"危险驾驶罪（醉驾）","是否被司法机关行政拘留或采取刑事强制措施期间":"","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":""},{"预估损失合计":"","个人绩效平均值":"","处分（按最轻处分举例）":"开除党籍、开除","薪酬扣减":"扣减全部未发放绩效薪酬，取消全部未行权的中长期激励权益","人员类别（党员）":"二线岗位操作人员","薪酬扣减数额":"","违法行为":"危险驾驶罪（醉驾）","是否被司法机关行政拘留或采取刑事强制措施期间":"","因强制管制需扣除日平均工资、月度奖、季度奖、年度工资结余、预发绩效等":"","影响期":""}];
const PERSONNEL_CATEGORY_LIST = Array.from(new Set(SOURCE_DATA.map(item => item['人员类别（党员）'])));
const ILLEGAL_BEHAVIOR_LIST = Array.from(new Set(SOURCE_DATA.map(item => item['违法行为'])));

const PERSONNEL_CATEGORY = 'PERSONNEL_CATEGORY';
const ILLEGAL_BEHAVIOR = 'ILLEGAL_BEHAVIOR';


Page({
    data: {
        value: 123,
        showPopup: false,
        popupType: '',
        popupSelectValue: '',
        selectList: [],
        popupTitle: '',

        personnelCategoryValue: '',
        illegalBehaviorValue: '',

        searchResult: []
    },

    onLoad() {
    },

    showPersonnelCategory() {
        this.data.popupType = PERSONNEL_CATEGORY
        this.setData({
            showPopup: true,
            popupTitle: '选择人员类别',
            popupSelectValue: this.data.personnelCategoryValue,
            selectList: PERSONNEL_CATEGORY_LIST,
        })
    },

    showIllegalBehavior() {
        this.data.popupType = ILLEGAL_BEHAVIOR
        this.setData({
            showPopup: true,
            popupTitle: '选择违法行为',
            popupSelectValue: this.data.illegalBehaviorValue,
            selectList: ILLEGAL_BEHAVIOR_LIST,
        })
    },

    popupCancelHandler() {
        this.popupCloseHandler();
    },

    popupConfirmHandler(e) {
        if (this.data.popupType === PERSONNEL_CATEGORY) {
            this.setData({
                personnelCategoryValue: e.detail
            })
        } 
        if (this.data.popupType === ILLEGAL_BEHAVIOR) {
            this.setData({
                illegalBehaviorValue: e.detail
            })
        }

        this.popupCloseHandler();
    },

    popupCloseHandler() {
        this.setData({
            showPopup: false,
        })
    },

    search() {
        const {personnelCategoryValue, illegalBehaviorValue} = this.data;
        if(!personnelCategoryValue) {
            Toast('请选择人员类别');
            return;
        }
        if(!illegalBehaviorValue) {
            Toast('请选择违法行为');
            return;
        }

        const result = SOURCE_DATA.find(item => 
            item['人员类别（党员）'] === this.data.personnelCategoryValue && item['违法行为'] === this.data.illegalBehaviorValue
        )

        const searchResult = []
        for (const key in result) {
            searchResult.push({
                title: key,
                value: result[key]
            })
        }

        this.setData({
            searchResult
        })
    }
})